<script lang="ts">
</script>

<div class="container">
	<h2>モチベーション</h2>
	<p>
		あるとちょっと便利なwebツールってありますよね。 文字数をカウントしたり、画像の形式を変換したり。
	</p>
	<p>
		インターネットで検索をかければ大抵欲しいツールは見つかりますが、ソースが公開されていなかったり、サーバーにデータを送っていたり、セキュリティ面の不安から利用を躊躇する場合があります。
	</p>
	<p>安心して使える自前のツールセットが欲しいと思ったのが、このサイトのモチベーションです。</p>

	<h2>理念</h2>
	<ul>
		<li>ブラウザオンリーで動作し、データを外部送信しない。</li>
		<li>
			極力外部ライブラリの利用を避け、ブラウザネイティブの動作で実現する。外部ライブラリに依存している場合は明示する。
		</li>
		<li>オープンソース TODO: githubへのリンクを張る</li>
	</ul>

	<h2>問い合わせ先</h2>
	<ul>
		<p>このサイトは最小限の機能しか搭載しないので、フォーム等ありません。</p>
		<p>機能追加のリクエストや不具合報告ありましたら、 github の issue へお願いいたします。</p>
	</ul>

	<h2>サイト構成</h2>
	<ul>
		<li>frontend: sveltekit</li>
		<li>hosting: cloudflare</li>
	</ul>
</div>

<style>
	p {
		padding-bottom: 0.5em;
	}
</style>
